In [111]:
import pandas as pd

In [112]:
population = pd.Series([9904312,3448737,2890451,2466052])

In [113]:
population = pd.Series([9904312,3448737,2890451,2466052],
                       index=['서울','부산','인천','대구'])

In [114]:
population.dtype

dtype('int64')

In [115]:
population.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [116]:
population.index.name = '도시'

In [117]:
population.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [118]:
population.name = '인구'

In [119]:
population/1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [120]:
population[1],population['부산']

(3448737, 3448737)

In [123]:
population[3],population['대구']

(2466052, 2466052)

In [124]:
population[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [125]:
population >= 2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [126]:
population[population >= 2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [127]:
(population>=2500000)&(population<=5000000)

도시
서울    False
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [128]:
population[(population>=2500000)&(population<=5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [129]:
population[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [130]:
population['부산':'대구'] # 대구의 실제 위치는 2이나 문자는 해당 까지 보여주어 [1:3]과 같음

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [131]:
data = {'서울' : 9631482, '부산' : 3393191,
       '인천' : 2632035, '대전' : 1490158}
population2 = pd.Series(data)
population2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [132]:
ds = population - population2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [133]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [134]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [135]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [136]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [137]:
rs = (population-population2)/population2*100
rs[rs.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [138]:
rs['부산'] = 1.6
rs['대구'] = 1.41
del rs['서울']
rs[rs.notnull()]

대구    1.410000
부산    1.600000
인천    9.818107
dtype: float64

In [139]:
data = {'2015' : [9904312, 3448737, 2890451, 2466052],
       '2010' : [9631482,3393191,2632035,2431774]}

In [140]:
df=pd.DataFrame(data)

In [141]:
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [142]:
df.index = ['서울','부산','인천','대구']

In [143]:
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [144]:
# 데이터가 딕셔너리 형태가 아니라 리스트 형대로 있을때
data = [[9904312, 3448737, 2890451, 2466052],[9631482,3393191,2632035,2431774]]
ind = ['2015','2010']
col = ['서울','부산','인천','대구']
df2 = pd.DataFrame(data, index = ind, columns = col) # 눕힘. 인덱스와 컬럼을 설정.

In [145]:
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [146]:
df.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [150]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [151]:
df2.index

Index(['2015', '2010'], dtype='object')

In [152]:
df.columns

Index(['2015', '2010'], dtype='object')

In [154]:
df2.columns

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [148]:
df['2015'] ## 컬럼을 넣어야함. (index를 넣고 싶다면 표를 눞혀야함.)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [149]:
df2['서울']

2015    9904312
2010    9631482
Name: 서울, dtype: int64

In [157]:
df[['2015']]

       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052

In [159]:
df['2010']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [158]:
df[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [160]:
df['2005']=[9762546,3512547,2517680,2456016]

In [161]:
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [162]:
df['index']=[1,2,3,4]

In [163]:
df

       2015     2010     2005  index
서울  9904312  9631482  9762546      1
부산  3448737  3393191  3512547      2
인천  2890451  2632035  2517680      3
대구  2466052  2431774  2456016      4

In [169]:
df[0:2]

       2015     2010     2005  index
서울  9904312  9631482  9762546      1
부산  3448737  3393191  3512547      2

In [170]:
df['서울':'인천']

       2015     2010     2005  index
서울  9904312  9631482  9762546      1
부산  3448737  3393191  3512547      2
인천  2890451  2632035  2517680      3

In [173]:
df.T

            서울       부산       인천       대구
2015   9904312  3448737  2890451  2466052
2010   9631482  3393191  2632035  2431774
2005   9762546  3512547  2517680  2456016
index        1        2        3        4

In [174]:
df

       2015     2010     2005  index
서울  9904312  9631482  9762546      1
부산  3448737  3393191  3512547      2
인천  2890451  2632035  2517680      3
대구  2466052  2431774  2456016      4

In [175]:
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [176]:
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [189]:
df2.T['2015']

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [191]:
df.loc['서울':'부산','2015':'2010']

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [193]:
df.iloc[3]

2015     2466052
2010     2431774
2005     2456016
index          4
Name: 대구, dtype: int64

In [194]:
df['2010'] >= 2500000

서울     True
부산     True
인천     True
대구    False
Name: 2010, dtype: bool

In [195]:
df[df['2010'] >= 2500000]

       2015     2010     2005  index
서울  9904312  9631482  9762546      1
부산  3448737  3393191  3512547      2
인천  2890451  2632035  2517680      3

# Excel 파일 불러오기

In [204]:
import pandas as pd

In [219]:
df1=pd.read_excel('C:/Users/SMT047/Desktop/수업/data/남북한발전전력량.xlsx')
df2=pd.read_excel('C:/Users/SMT047/Desktop/수업/data/남북한발전전력량.xlsx',header=None)

In [220]:
df1

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [221]:
df2

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
0,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
1,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
2,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
3,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
4,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
5,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
6,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
7,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
8,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
9,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [222]:
print(df1)
print('\n')   # 엔터
print(df2)

  전력량 (억㎾h) 발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...  2007  \
0        남한     합계  1077  1186  1310  1444  1650  1847  2055  2244  ...  4031
1       NaN     수력    64    51    49    60    41    55    52    54  ...    50
2       NaN     화력   484   573   696   803  1022  1122  1264  1420  ...  2551
3       NaN    원자력   529   563   565   581   587   670   739   771  ...  1429
4       NaN    신재생     -     -     -     -     -     -     -     -  ...     -
5        북한     합계   277   263   247   221   231   230   213   193  ...   236
6       NaN     수력   156   150   142   133   138   142   125   107  ...   133
7       NaN     화력   121   113   105    88    93    88    88    86  ...   103
8       NaN    원자력     -     -     -     -     -     -     -     -  ...     -

   2008  2009  2010  2011  2012  2013  2014  2015  2016
0  4224  4336  4747  4969  5096  5171  5220  5281  5404
1    56    56    65    78    77    84    78    58    66
2  2658  2802  3196  3343  3430  3581  3427  3402  3523
3  1510  1478  1486  1547  1503  1388  1564  1648  1620
4     -     -     -     -    86   118   151   173   195
5   255   235   237   211   215   221   216   190   239
6   141   125   134   132   135   139   130   100   128
7   114   110   103    79    80    82    86    90   111
8     -     -     -     -     -     -     -     -     -

[9 rows x 29 columns]


          0       1     2     3     4     5     6     7     8     9   ...  \
0  전력량 (억㎾h)  발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...
1         남한      합계  1077  1186  1310  1444  1650  1847  2055  2244  ...
2        NaN      수력    64    51    49    60    41    55    52    54  ...
3        NaN      화력   484   573   696   803  1022  1122  1264  1420  ...
4        NaN     원자력   529   563   565   581   587   670   739   771  ...
5        NaN     신재생     -     -     -     -     -     -     -     -  ...
6         북한      합계   277   263   247   221   231   230   213   193  ...
7        NaN      수력   156   150   142   133   138   142   125   107  ...
8        NaN      화력   121   113   105    88    93    88    88    86  ...
9        NaN     원자력     -     -     -     -     -     -     -     -  ...

     19    20    21    22    23    24    25    26    27    28
0  2007  2008  2009  2010  2011  2012  2013  2014  2015  2016
1  4031  4224  4336  4747  4969  5096  5171  5220  5281  5404
2    50    56    56    65    78    77    84    78    58    66
3  2551  2658  2802  3196  3343  3430  3581  3427  3402  3523
4  1429  1510  1478  1486  1547  1503  1388  1564  1648  1620
5     -     -     -     -     -    86   118   151   173   195
6   236   255   235   237   211   215   221   216   190   239
7   133   141   125   134   132   135   139   130   100   128
8   103   114   110   103    79    80    82    86    90   111
9     -     -     -     -     -     -     -     -     -     -

[10 rows x 29 columns]

In [229]:
population_number = pd.read_csv('C:/Users/SMT047/Desktop/수업/data/population_number.csv',encoding='euc-kr')
population_number

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [228]:
population_number = pd.read_csv('C:/Users/SMT047/Desktop/수업/data/population_number.csv', index_col='도시', encoding='euc-kr')
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990